laminarOptimizer/app/constant/tuneOptParameters
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      tuneOptParameters;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Optimizer stopping controls.
// The optimizer exits early only after the design step, objective drift,
// and constraint violation all remain small for several consecutive loops.
convergenceControl
{
    optMinIterations    50;
    optStallWindow      5;
    optObjectiveTol     1e-3;
    optConstraintTol    1e-3;
    optStepTol          5e-3;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
